# The Sky Team Project: Analysis

## This notebook explains what this project is, what it means, and what we did with it.

### First, some background on the name...

You might recognize our team name, "Sky Team," as being very similar to one of the world's leading airline alliances, SkyTeam. This isn't unintentional. We felt this was a great name for our project, as our mutual love of aviation and interest in exploring the massive amount of data that was collected by San Francisco Airport Commission.

### About that data...

It's located [here](https://catalog.data.gov/dataset/air-traffic-passenger-statistics), and it's from San Francisco International Airport. The City of San Francisco, through its SFO Airport Commission, is responsible for the data we used.

### What's the point?

What we have here is an aviation enthusiast (or data scientist's) dream. We have over 17,500 rows of data, spanning over 12 years! In SFO alone, the airline industry has changed so much over that period of time that there will be plenty of observable trends derived from the metrics gleaned by SFOAC in this databank. There's even many airlines on that list who (sadly) no longer grace our skies...the consolidation of the airline industry from 2009-2015 has really left its mark.

### Import sqlite3, Pandas, and the ipython-sql (%sql) Jupyter extension...and a few more.

Like all great Jupyter notebooks, our project revolves around several Python modules that were essential for the proper excecution of our code. These were SQLite, Pandas, Numpy, MatPlotLib, Seaborn, GeoPy, Basemap, rgb2hex, Polygon, ScalarMappable, Colorbarbase, and Math.

In [4]:
# Here are all the modules we used.
import sqlite3
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from matplotlib.colors import rgb2hex
from matplotlib.patches import Polygon
from matplotlib.cm import ScalarMappable
from matplotlib.colorbar import ColorbarBase
import matplotlib as mpl
import math

%load_ext sql

### Connecting to the database

In [5]:
%sql sqlite:///airpassenger.db

'Connected: None@airpassenger.db'

## The Terminals

As you might imagine, terminal information is a crucially important part of air travel.

In [3]:
airportterminal_rs = %sql None@airpassenger.db SELECT * FROM AIRPORTDIMENSION;
airportterminal = airportterminal_rs.DataFrame().set_index('AirportID')
airportterminal

Done.

                Terminal BoardingArea
AirportID
1             Terminal 1            B
2          International            G
3          International            A
4             Terminal 3            E
5             Terminal 1            C
6             Terminal 1            A
7             Terminal 3            F
8                  Other        Other
9             Terminal 2            D

In [ ]:
# I was thinking here would be a good place to show the utilization of terminals over the entire dataset, maybe in a histogram. However, I have had nothing but trouble doing this. I will keep trying in the meantime.

In [ ]:
# We could then show the terminal allocation from 2005-2011.

In [ ]:
# Then, we could show 2011-2017 terminal allocation.

In [13]:
"Create a histogram that shows the distribution of terminals among flights."
terminalmap = boardingarea['airportterminal']
plt.hist(age, alpha=.40, label='Terminal', bins=6, ec="k")
plt.xlabel('Terminal Number')
plt.ylabel('Number of Passengers')
plt.title('Distribution of Passengers Among Terminals')

# Add legend
plt.legend()

# Show the figure
plt.show()

NameError: name 'age' is not defined

In [4]:
passenger_rs = %sql None@airpassenger.db SELECT * FROM PASSENGERFACT;
passenger = passenger_rs.DataFrame().set_index('EntryID')
passenger

Done.

,OperatingID,AirportID,GeoID,ActivityID,TimeID,PublishedID,PassengerCount
EntryID,,,,,,,
1,1,1,1,1,1,1,27271
2,1,1,1,2,1,1,29131
3,1,1,1,3,1,1,5415
4,1,1,1,1,2,1,27472
5,1,1,1,2,2,1,26535
6,1,1,1,3,2,1,5712
7,1,1,1,1,3,1,17341
8,1,1,1,2,3,1,18541
9,1,1,1,3,3,1,4412
10,1,1,1,1,5,1,17698
11,1,1,1,2,5,1,19983
12,1,1,1,3,5,1,5754
13,1,1,1,1,6,1,16855
14,1,1,1,2,6,1,17376
15,1,1,1,3,6,1,2911
16,1,1,1,1,7,1,15373
17,1,1,1,2,7,1,16790
18,1,1,1,3,7,1,2402
19,1,1,1,1,8,1,13010
20,1,1,1,2,8,1,12226
21,1,1,1,3,8,1,3316
22,1,1,1,1,9,1,9180
23,1,1,1,2,9,1,10323
24,1,1,1,3,9,1,3863
25,1,1,1,1,10,1,11583
26,1,1,1,2,10,1,11921
27,1,1,1,3,10,1,3870
28,1,1,1,1,11,1,11920
29,1,1,1,2,11,1,11890
30,1,1,1,3,11,1,2419
...,...,...,...,...,...,...,...
193786,54,9,1,1,145,47,236342
193787,54,9,1,2,145,47,231897
193788,54,9,2,2,145,47,5328
193789,54,9,3,2,145,47,5328
193790,54,9,4,2,145,47,5328
193791,54,9,5,2,145,47,5328
193792,54,9,6,2,145,47,5328
193793,54,9,7,2,145,47,5328
193794,54,9,8,2,145,47,5328
193795,54,9,9,2,145,47,5328
193796,54,9,1,1,146,47,236923
193797,54,9,1,2,146,47,233852
193798,54,9,2,2,146,47,3582
193799,54,9,3,2,146,47,3582
193800,54,9,4,2,146,47,3582
193801,54,9,5,2,146,47,3582
193802,54,9,6,2,146,47,3582
193803,54,9,7,2,146,47,3582
193804,54,9,8,2,146,47,3582
193805,54,9,9,2,146,47,3582
193806,54,9,1,1,147,47,218204
193807,54,9,1,2,147,47,223301
193808,54,9,2,2,147,47,1846
193809,54,9,3,2,147,47,1846
193810,54,9,4,2,147,47,1846
193811,54,9,5,2,147,47,1846
193812,54,9,6,2,147,47,1846
193813,54,9,7,2,147,47,1846
193814,54,9,8,2,147,47,1846
193815,54,9,9,2,147,47,1846

In [ ]:
# I was then hoping to create a bar chart showing the distribution of places the flights went to.

In [ ]:
# We could then do one that shows what % of the flights were "Low Fare."

In [ ]:
# Then after that, a pie chart showing the % breakdown of flights enplaned, in-transit, and deplaned.

In [ ]:
# Once we have that, it should be relatively easier to make one for 2005-2011.

In [ ]:
# Then, the same for 2011-2017. This will help emphasize the industry shift. I will write descriptions in Markdown for all of them.

In [10]:
%%sql
select terminal, sum(passengercount)
from AIRPORTDIMENSION JOIN PASSENGERFACT ON (AIRPORTDIMENSION.AirportID = PASSENGERFACT.AirportID)
group by terminal;

Done.

[('International', 1805337136),
 ('Other', 228),
 ('Terminal 1', 407671524),
 ('Terminal 2', 48724642),
 ('Terminal 3', 559782518)]

In [17]:
airportterminal_rs = %sql None@airpassenger.db select ActivityType, sum(passengercount) from ACTIVITYDIMENSION JOIN PASSENGERFACT ON (ACTIVITYDIMENSION.ActivityID = PASSENGERFACT.ActivityID) group by ActivityType;
airportterminal = airportterminal_rs.DataFrame()
airportterminal

Done.

     ActivityType  sum(passengercount)
0        Deplaned           1412383233
1        Enplaned           1399418473
2  Thru / Transit              9714342

In [ ]:
%%sql
select ActivityType, sum(passengercount)
from ACTIVITYDIMENSION JOIN PASSENGERFACT ON (ACTIVITYDIMENSION.ActivityID = PASSENGERFACT.ActivityID)
group by ActivityType;

In [ ]:
ax = sns.barplot(y)

In [ ]:
# Lastly, a histogram of passenger volumes by -year would be helpful. Since there are so many years, that should be granular enough.

# Once I know how to do this, it would be good to choose date ranges that seperate passenger volumes by season - so we can see the busiest times/years to fly, and compare them.

# It would also be good to make a histogram of UNIQUE Airlines - so we can see the consolidation that took place with the mergers and eliminated a lot of choice in the market over this timespan.

### We will merge the operating airport dimension  with another dataset

In [15]:
#taking the hosted csv file and creating the air-traffic-landings-statistics.csv
url = 'https://data.sfgov.org/api/views/fpux-q53t/rows.csv?accessType=DOWNLOAD'
from urllib.request import urlretrieve
urlretrieve(url, 'air-traffic-landings-statistics.csv')

('air-traffic-landings-statistics.csv',
 <http.client.HTTPMessage at 0x1a108200b8>)

In [16]:
import pandas as pd
# importing air-traffic-landings-statistics.csv into table called data
data = pd.read_csv('air-traffic-landings-statistics.csv')
data.head()

,Activity Period,Operating Airline,Operating Airline IATA Code,Published Airline,Published Airline IATA Code,GEO Summary,GEO Region,Landing Aircraft Type,Aircraft Body Type,Aircraft Manufacturer,Aircraft Model,Aircraft Version,Landing Count,Total Landed Weight
0,200507,ABX Air,GB,ABX Air,GB,Domestic,US,Freighter,Narrow Body,McDonnell Douglas,DC-9,30,40,4066000
1,200507,ABX Air,GB,ABX Air,GB,Domestic,US,Freighter,Narrow Body,McDonnell Douglas,DC-9,41,1,102000
2,200507,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Passenger,Narrow Body,Boeing,757,200,2,396000
3,200507,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Passenger,Narrow Body,Boeing,757,300,167,37408000
4,200507,Air Canada,AC,Air Canada,AC,International,Canada,Passenger,Wide Body,Boeing,767,333,1,320000

/* *** Transfering OPERATINGAIRDIMENSION into dataframe  *** */

In [19]:
operatingairline_rs = %sql None@airpassenger.db select * from OPERATINGAIRDIMENSION;
operatingairline = operatingairline_rs.DataFrame().set_index('OperatingID')

Done.

In [20]:
#merging two tables together which is operatingairline and data
airlanding = pd.merge(left=operatingairline,right=data,left_on='OperatingIATA',right_on='Operating Airline IATA Code')
airlanding.head()

,OperatingAirlineIdentifier,OperatingIATA,Activity Period,Operating Airline,Operating Airline IATA Code,Published Airline,Published Airline IATA Code,GEO Summary,GEO Region,Landing Aircraft Type,Aircraft Body Type,Aircraft Manufacturer,Aircraft Model,Aircraft Version,Landing Count,Total Landed Weight
0,ATA Airlines,TZ,200507,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Passenger,Narrow Body,Boeing,757,200,2,396000
1,ATA Airlines,TZ,200507,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Passenger,Narrow Body,Boeing,757,300,167,37408000
2,ATA Airlines,TZ,200508,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Passenger,Narrow Body,Boeing,737,800,1,146300
3,ATA Airlines,TZ,200508,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Passenger,Narrow Body,Boeing,757,200,3,594000
4,ATA Airlines,TZ,200508,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Passenger,Narrow Body,Boeing,757,300,159,35616000

In [12]:
#deleting all rows that have Landing Aircraft Type is Freighter
airline = airlanding[airlanding['Landing Aircraft Type'] != "Freighter"]
airline.head()

,OperatingAirlineIdentifier,OperatingIATA,Activity Period,Operating Airline,Operating Airline IATA Code,Published Airline,Published Airline IATA Code,GEO Summary,GEO Region,Landing Aircraft Type,Aircraft Body Type,Aircraft Manufacturer,Aircraft Model,Aircraft Version,Landing Count,Total Landed Weight
0,ATA Airlines,TZ,200507,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Passenger,Narrow Body,Boeing,757,200,2,396000
1,ATA Airlines,TZ,200507,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Passenger,Narrow Body,Boeing,757,300,167,37408000
2,ATA Airlines,TZ,200508,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Passenger,Narrow Body,Boeing,737,800,1,146300
3,ATA Airlines,TZ,200508,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Passenger,Narrow Body,Boeing,757,200,3,594000
4,ATA Airlines,TZ,200508,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Passenger,Narrow Body,Boeing,757,300,159,35616000

In [21]:
#checking to see which Aircraft Manufacturer is operated the most
airline['Aircraft Manufacturer'].value_counts()

Boeing               13820
Airbus                5655
Bombardier            1133
Embraer                586
McDonnell Douglas      473
DeHavilland             41
Lockheed                 5
Name: Aircraft Manufacturer, dtype: int64

In [22]:
#Counting which airlines make the most landing
Landing = airline.groupby(by='OperatingAirlineIdentifier')['Landing Count'].sum().sort_values()
Landing

OperatingAirlineIdentifier
Xtra Airways                                 1
World Airways                                3
Atlas Air, Inc                               7
Miami Air International                     11
BelAir Airlines                             33
Thomas Cook Airlines                        40
Finnair                                     52
Air Pacific Limited dba Fiji Airways        79
Allegiant Air                               88
Icelandair                                 119
Jet Airways                                181
XL Airways France                          204
Republic Airlines                          285
Spirit Airlines                            314
Independence Air                           318
WOW Air                                    364
Air India Limited                          428
Air Berlin                                 505
Volaris Airlines                           509
Atlantic Southeast Airlines                585
Air Canada Jazz                            644
Jazz Aviation                              644
LAN Peru                                   684
Turkish Airlines                           876
Etihad Airways                             911
China Southern                             942
Mesaba Airlines                           1000
COPA Airlines, Inc.                       1026
ATA Airlines                              1396
SAS Airlines                              1501
                                         ...
Philippine Airlines                       4812
Mexicana Airlines                         4998
Air France                                5227
Virgin Atlantic                           5235
Sun Country Airlines                      5542
Hawaiian Airlines                         5544
Aeromexico                                6223
TACA                                      6288
American Eagle Airlines                   7171
EVA Airways                               7619
Cathay Pacific                            8374
Lufthansa German Airlines                 8697
British Airways                           8807
Singapore Airlines                        8954
AirTran Airways                           9901
Horizon Air                              10495
Northwest Airlines                       19282
Frontier Airlines                        23919
Compass Airlines                         23961
Air Canada                               37820
JetBlue Airways                          40744
US Airways                               62772
Alaska Airlines                          71193
Delta Air Lines                         101861
American Airlines                       146460
Southwest Airlines                      147152
Virgin America                          153620
SkyWest Airlines                        540654
United Airlines                         686835
United Airlines - Pre 07/01/2013        686835
Name: Landing Count, Length: 77, dtype: int64